Tekla Open API Reference for Tekla Structures 2025
Point Constructor
 Instantiates a point with zero members.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point()
Public Sub New
See Also
Reference
Point Class
Point Overload
Tekla.Structures.Geometry3d Namespace